-- ========================================================
-- ЛР 2 Вариант 2
-- ========================================================

-- --------------------------------------------------------------------
-- Задача 1. (JOINs)
-- Показать имена продавцов и адреса дилерских центров,где они работают.
------------------------------------------------------------------------
select 
    s.first_name, 
    d.street_address 
from salespeople s
inner join dealerships d 
    on s.dealership_id = d.dealership_id
order by first_name, street_address asc;

-- --------------------------------------------------------------------
-- Задача 2. (Subqueries / UNION)
-- Выведите список всех городов, в которых есть либо клиенты, либо дилерские центры (UNION).
------------------------------------------------------------------------
select city from dealerships d
union
select city from customers c
order by city;


-- --------------------------------------------------------------------
-- Задача 3. (Data Prep)
-- Выведите список клиентов. Если телефон не указан, вывести 'No Phone' (COALESCE).
------------------------------------------------------------------------
select 
    first_name,
    last_name,
    COALESCE(phone, 'No Phone')
from customers c
order by first_name;
