-- ========================================================
-- ЛР 3 Вариант 2
-- ========================================================

-- --------------------------------------------------------------------
-- Задача 1. (Базовые агрегаты)
-- 	Посчитать общее количество записей в таблице sales.
------------------------------------------------------------------------
select 
    COUNT(*)
from sales s

-- --------------------------------------------------------------------
-- Задача 2.(Группировка GROUP BY)
-- Вычислить среднюю цену продукта для каждого типа (product_type).
------------------------------------------------------------------------
select 
    product_type, 
    round(avg(base_msrp), 2) as avg_msrp
from products p
group by product_type;

-- --------------------------------------------------------------------
-- Задача 3. (Фильтрация HAVING и Аналитика)
-- Найти dealership_id, совершивших более 100 продаж.
------------------------------------------------------------------------
select 
    dealership_id, 
    count(*) as total_sales
from 
    sales s
group by 
    dealership_id
having 
    count(*) > 100;
